%--------------------------------------------------------------------------
%   初始化
%--------------------------------------------------------------------------
clear;clc;

%--------------------------------------------------------------------------
%   参数设置
%--------------------------------------------------------------------------
c = 3e8;                                                                    %光速
fc = 20e9;                                                                  %频率
lambda = c/fc;                                                              %波长
R = 1000;                                                                   %放置信号发生源
Received = [];
radar_pos = [lambda/4+lambda/2 lambda/4 -lambda/4 -lambda/4 - lambda/2;...
                    0             0         0             0 ;
                    0             0         0             0];              %雷达阵元坐标
step = 2;                                                                   %步长

%--------------------------------------------------------------------------
%   导向矢量计算
%--------------------------------------------------------------------------
for w_theta = 0:180                                                        %假设我要指向20°
    tgt_pos = [R*cosd(w_theta) R*sind(w_theta) 0]';                         %发射机坐标
    for idx = 1:size(radar_pos,2)
        R_temp(:,idx) = norm(radar_pos(:,idx) - tgt_pos);
    end
    sig = 1.*exp(1j.*R_temp.'/lambda * 2 * pi);                                 %发射信号为1到达接收时候的强度
    w = conj(sig);                                                              %导向矢量因为电磁波传播方向相反

    [theta_angle,E] = sp.array_pattern(radar_pos,lambda,w);                     %前面的一坨打包成函数

    %----------------------------------------------------------------------
    %   可视化
    %----------------------------------------------------------------------
    f1 = figure(1);
    f1.Position = [215 361 1071 518];
    subplot(121)
    plot(theta_angle,db(sum(E,2)));                                                %db(x)相当于20*log10(abs(x))
    axis([0 179 -inf inf]);grid on
    title('天线方向图');xlabel('角度 °');ylabel('增益 db')
    
    subplot(122)
    polarplot(deg2rad(theta_angle(1797:end)),abs(sum(E(1797:end,:),2)));
    title('极坐标天线方向图')
    drawnow()
end