%--------------------------------------------------------------------------
%   初始化
%--------------------------------------------------------------------------
clear;clc;

%--------------------------------------------------------------------------
%   参数设置
%--------------------------------------------------------------------------
c = 3e8;                                                                    %光速
fc = 20e9;                                                                  %频率
lambda = c/fc;                                                              %波长

R = 1000;                                                                   %放置信号发生源

Rx = [];
radar_pos = [0;0];                                                          %雷达坐标
step = 2;                                                                   %步长
for theta = 0:step:359                                                      %让目标旋转360°
    tgt_pos = [R*cosd(theta);R*sind(theta)];                                %发射机坐标，%gpt_  根据当前角度计算目标的坐标位置，使用极坐标转换为直角坐标系。
    R = norm(tgt_pos - radar_pos);                                          %获得镜像距离，%gpt_  计算目标到雷达的距离，使用欧几里得范数。
    sig = 1.*exp(1j.*R/lambda * 2 * pi);                                    %发射信号为1到达接收时候的强度
    Rx = [Rx sig];                                                          %保存输出信号

    %----------------------------------------------------------------------
    %   可视化
    %----------------------------------------------------------------------
    figure(1)
    subplot(2,2,[1 3])   %表示将第1和3小块连成一个大块
    plot(radar_pos(1),radar_pos(2),'bo',tgt_pos(1),tgt_pos(2),'ro');   
        %gpt_  radar_pos(1),radar_pos(2): 这是雷达的坐标位置，radar_pos(1)表示雷达在x轴上的坐标，radar_pos(2)表示雷达在y轴上的坐标
        %gpt_  'bo': 'b'表示蓝色，'o'表示圆圈(marker)的样式。所以'bo'表示用蓝色的圆圈表示雷达的位置
        %gpt_  tgt_pos(1),tgt_pos(2): 这是目标的坐标位置
        %gpt_  'ro': 'r'表示红色，'o'表示圆圈(marker)的样式
    axis equal;   %gpt_  设置坐标轴的刻度相等，保持图形的比例。
    axis([-R R -R R]);   %gpt_  设置坐标轴的范围，根据信号发生源到雷达的距离R来确定
    grid on;   %gpt_  打开坐标网格线
    title(['角度 -> ' num2str(theta)])   %gpt_  num2str(theta)：这个函数将变量 theta 的值转换为字符串

    subplot(222)
    plot(0:step:theta,db(Rx));                                              %db(x)相当于20*log10(abs(x))
    axis([0 359 -2 2]);grid on
    title('天线方向图');xlabel('角度 °');ylabel('增益 db')

    subplot(224)
    polarplot(deg2rad(0:step:theta),abs(Rx));   
    %gpt_  deg2rad函数是一个角度转换操作，将从0到theta以步长step变化的角度序列转换为弧度制表示。deg2rad函数将角度转换为弧度。
    %gpt_  abs函数用于计算复数的绝对值，即幅度。
    title('极坐标天线方向图')
    drawnow()   %gpt_  drawnow(): 即时更新图形窗口，以便观察动态变化。
end